meltFoam_enthaplyporosity/testCase/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4.1                                 |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version 2.0;
    format ascii;

    root "/home/zaki/OpenFOAM/zaki-1.4.1/run/tutorials/meltFoam";
    case "cavity672";
    instance "0";
    local "";

    class volScalarField;
    object T;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 301.3;

boundaryField
{
    leftWall
    {
        type            fixedValue;
        value           uniform 311;
    }
    rightWall
    {
        type            fixedValue;
        value           uniform 301.3;
    }
    bottomWall
    {
        type            zeroGradient;
    }
    topWall
    {
        type            zeroGradient;
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
