meltFoam_enthaplyporosity/testCase/constant/polyMesh/blockMeshDict
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.3                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

// FoamX Case Dictionary.

FoamFile
{
    version         2.0;
    format          ascii;

    root            "/home/zaki/OpenFOAM/zaki-1.3/run/tutorials/icoMeltFoam";
    case            "cavity";
    instance        "constant/polyMesh";
    local           "";

    class           dictionary;
    object          blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

arguments       "/home/zaki/OpenFOAM/zaki-1.3/run/tutorials/icoMeltFoam/cavity" off;

convertToMeters 0.01;

vertices        
(
    (0 0 0)
    (8.89 0 0)
    (0 6.35 0)
    (8.89 6.35 0)
    (0 0 0.1)
    (8.89 0 0.1)
    (0 6.35 0.1)
    (8.89 6.35 0.1)
);

blocks          
(
    hex (0 1 3 2 4 5 7 6) (42 32 1) simpleGrading (1 1 1)
);

edges           
(
);

patches         
(
    wall leftWall 
    (
        (0 4 6 2)
    )
    wall rightWall 
    (
        (1 5 7 3)
    )
    wall bottomWall 
    (
        (0 1 5 4)
    )
    wall topWall 
    (
        (2 3 7 6)
    )
);

mergePatchPairs 
(
);


// ************************************************************************* //
