meltFoam_enthaplyporosity/testCase/constant/transportProperties
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.3                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

// FoamX Case Dictionary.

FoamFile
{
    version         2.0;
    format          ascii;

    root            "/home/zaki/OpenFOAM/zaki-1.3/run/tutorials/icoMeltFoam";
    case            "cavity";
    instance        "constant";
    local           "";

    class           dictionary;
    object          transportProperties;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

rho0            rho0 [1 -3 0 0 0 0 0] 6093;

T0              T0 [0 0 0 1 0 0 0] 302.78;

Tm              Tm [0 0 0 1 0 0 0] 302.78;

Tl              Tl [0 0 0 1 0 0 0] 302.78;

Ts              Ts [0 0 0 1 0 0 0] 302.78;

L               L [0 2 -2 0 0 0 0] 80160;

mu              mu [1 -1 -1 0 0 0 0] 1.81e-03;

ktherm          ktherm [1 1 -3 -1 0 0 0] 32;

Cp              Cp [0 2 -2 -1 0 0 0] 381.5;

g               g [0 1 -2 0 0 0 0] (0 -9.81 0);

beta            beta [0 0 0 -1 0 0 0] 1.2e-04;

C               C [1 -3 -1 0 0 0 0] 1.6e+6;

omegaDH         omegaDH [0 0 0 0 0 0 0] 0.3;
// ************************************************************************* //
