meltFoam_enthaplyporosity/testCase/system/fvSolution
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.3                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

// FoamX Case Dictionary.

FoamFile
{
    version         2.0;
    format          ascii;

    root            "/home/zaki/OpenFOAM/zaki-1.3/run/tutorials/icoFoam";
    case            "cavity";
    instance        "system";
    local           "";

    class           dictionary;
    object          fvSolution;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
//    p               GaussSeidel 1e-06 0 1;
//    U               GaussSeidel 1e-08 0 1;
//    T               GaussSeidel 1e-08 0 1;
//    p               ICCG 1e-06 0;
//    p               AMG 1e-06 0 100; 
//    U               BICCG 1e-08 0;
//    T               BICCG 1e-08 0;
    p GAMG 
    {
        tolerance 1e-06;
        relTol 0;
        nCellsInCoarsestLevel 25;
        mergeLevels 1;
        agglomerator faceAreaPair; 
        smoother GaussSeidel;
        nPreSweeps 0;
        nPostSweeps 2;
        nFinestSweeps 2; 
    };
//    p PCG
//    {
//        preconditioner   DIC;
//        tolerance        1e-06;
//        relTol           0;
//    };

    U PBiCG
    {
        preconditioner   DILU;
        tolerance        1e-06;
        relTol           0;
    };
    h PBiCG
    {
        preconditioner   DILU;
        tolerance        1e-06;
        relTol           0;
    };
    T PBiCG
    {
        preconditioner   DILU;
        tolerance        1e-06;
        relTol           0;
    };
}

SIMPLE
{
    nNonOrthogonalCorrectors 0;
    pRefCell        0;
    pRefValue       0;
    convergence     1e-06;
    iterMin	    60;
}

relaxationFactors
{
    p               0.3;
    U               0.5;
    T               0.3;
    h               0.3;
}

// ************************************************************************* //
